In [1]:
import pandas as pd

In [5]:
data = {'ProductName' : ['Apple', 'Dell', 'Lenovo'], 'Prices' : [109000 , 70000, 50000 ] }

In [6]:
df = pd.DataFrame(data)
df

  ProductName  Prices
0       Apple  109000
1        Dell   70000
2      Lenovo   50000

In [9]:
df = pd.DataFrame(data, index=['A', 'B', 'C'])
df

  ProductName  Prices
A       Apple  109000
B        Dell   70000
C      Lenovo   50000

In [12]:
data = {'Name' : ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 'Age' :[50, 53, 35, 43] , 'Working Experience (Yrs.)' : [5, 8, 3, 10]}
df = pd.DataFrame(data)
df

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10